{"input":"A car is being driven, in a straight line and at a uniform speed, towards the base of a vertical tower. The top of the tower is observed from the car and, in the process, it takes 10 minutes for the angle of elevation to change from 45° to 60°. After how much more time will this car reach the base of the tower?Answer Choices:(a) 5(√3 + 1(b) 6(√3 + √2(c) 7(√3 – 1(d) 8(√3 – 2(e) None of these","target":"(a)"}
{"input":"The original price of an item is discounted 22%. A customer buys the item at this discounted price using a $20-off coupon. There is no tax on the item, and this was the only item the customer bought. If the customer paid $1.90 more than half the original price of the item, what was the original price of the item?Answer Choices:(a) $61(b) $65(c) $67.40(d) $70(e) $78.20","target":"(e)"}
{"input":"Find out which of the following values is the multiple of X, if it is divisible by 9 and 12?Answer Choices:(a) 36(b) 15(c) 17(d) 5(e) 7","target":"(a)"}
{"input":"If the probability that Stock A will increase in value during the next month is 0.56, and the probability that Stock B will increase in value during the next month is 0.74. What is the greatest value for the probability that neither of these two events will occur?Answer Choices:(a) 0.22(b) 0.26(c) 0.37(d) 0.46(e) 0.63","target":"(b)"}
{"input":"A trader sold an article at a profit of 20% for Rs.360. What is the cost price of the article?Answer Choices:(a) 270(b) 300(c) 280(d) 320(e) 315","target":"(b)"}
{"input":"20 marbles were pulled out of a bag of only white marbles, painted black, and then put back in. Then, another 20 marbles were pulled out, of which 1 was black, after which they were all returned to the bag. If the percentage of black marbles pulled out the second time represents their percentage in the bag, how many marbles in total Q does the bag currently hold?Answer Choices:(a) 40(b) 200(c) 380(d) 400(e) 3200","target":"(d)"}
{"input":"Find the total no. of distinct bike no.'s that can beformed using 2 letters followed by 2 no.'s. How many letters need to be distinct?Answer Choices:(a) 74453(b) 64543(c) 74325(d) 65000(e) 97656","target":"(d)"}
{"input":"A train running at a speed of 100 miles\/hour, takes 10 hours to reach its destination. After covering quarter of the distance, it starts raining and the train has to be slowed to speed of 75 miles\/hour. What is the total journey duration?Answer Choices:(a) 10(b) 11.5(c) 12.5(d) 13.5(e) 15","target":"(c)"}
{"input":"Of the 200 students in a school, at least 45% attended the prom night and at least 35% took part in the debating session. What is the maximum number of students who could have neither attended the prom night nor the debating session?Answer Choices:(a) 27(b) 81(c) 90(d) 99(e) 110","target":"(e)"}
{"input":"A sales person gets a 10% commission on each sale he makes. How many sales of $250 each must he make in order to reach a salary of at least $1000?Answer Choices:(a) 15(b) 24(c) 25(d) 40(e) 52","target":"(d)"}
{"input":"A company produces 420 units of a particular computer component every month, at a production cost to the company of $110 per component, and sells all of the components by the end of each month. What is the minimum selling price per component that will guarantee that the yearly profit (revenue from sales minus production costs) will be at least $626,400 ?Answer Choices:(a) 226(b) 230(c) 240(d) 260(e) 280","target":"(b)"}
{"input":"At a certain factory, 10 percent of the staplers produced on Monday were defective and 2 percent of the non-defective staplers were rejected by mistake. If 72 of the non-defective staplers were rejected, what was the number of staplers produced that day?Answer Choices:(a) 4,000(b) 4,200(c) 4,500(d) 4,800(e) 5,000","target":"(a)"}
{"input":"Machine A puts out a yo-yo every 6 minutes. Machine B puts out a yo-yo every 9 minutes. After how many minutes will they have produced 10 yo-yos?Answer Choices:(a) 24 minutes(b) 32 minutes(c) 36 minutes(d) 64 minutes(e) 72 minutes","target":"(c)"}
{"input":"Add: +45 and -30Answer Choices:(a) -30(b) +30(c) 0(d) 15(e) -15","target":"(d)"}
{"input":"In how many ways can the letters of the word \"PROBLEC\" be rearranged to make 7 letter words such that none of the letters repeat?Answer Choices:(a) 2!(b) 3!(c) 7!(d) 8!(e) 9!","target":"(c)"}
{"input":"Let A and B be independent events with P (A) = 0.2 and P(B) = 0.8. Find P(A\/B)?Answer Choices:(a) 0.2(b) 0.4(c) 0.6(d) 1.2(e) 1.5","target":"(a)"}
{"input":"Consider there is an staircase elevator and you are coming down. If you walk 20 steps and stop, then you reach bottom in 10 minutes. If you walk 10 steps and stop, you reach to the ground in 20 minutes. What is the speed of the elevator?Answer Choices:(a) 1 step\/minute(b) 2 step\/minute(c) 3 step\/minute(d) 4 step\/minute(e) None of the above","target":"(a)"}
{"input":"Last year, a Home Appliance Store sold an average(arithmetic mean) of 42 microwave ovens per month. In the first 10 months of this year,the store has sold an average(arithmetic mean) of only 20 microwave ovens per month. What was the average number of microwave ovens sold per month during the entire 22 months period ?Answer Choices:(a) 21(b) 30(c) 31(d) 32(e) None of the above","target":"(d)"}
{"input":"An exam is given in a certain class. The average (arithmetic mean) of the highest score and the lowest score is equal to x. If the average score for the entire class is equal to y and there are z students in the class, where z > 5, then in terms of x, y, and z, what is the average score for the class excluding the highest and lowest scorers?Answer Choices:(a) (zy – 2x(b) (zy – 2(c) (zx – y(d) (zy – 2x(e) (zy – x","target":"(d)"}
{"input":"[5 + ? × 19 - 15 - 7]\/[13 × 13 - 156] = 6Answer Choices:(a) 4(b) 4.5(c) 5(d) 5.5(e) 6.5","target":"(c)"}
{"input":"A grocer makes a 25% profit on the selling price for each bag of flour it sells. If he sells each bag for $100 and makes $3,000 in profit, how many bags did he sell?Answer Choices:(a) 12(b) 16(c) 24(d) 30(e) 40","target":"(c)"}
{"input":"Alex and Jacob works at a toy shop that make toys. Alex takes 7 hours to make a toy, and Jacob takes 9 hours to make a toy. During a month, both of them makes 35 toys in total. If both of them have worked for almost similar number of hours how many toys have been prepared by Jacob?Answer Choices:(a) 15(b) 16(c) 17(d) 18(e) 19","target":"(a)"}
{"input":"John likes to have lightly flavored tea every evening. In a 50% strong milk tea, he replaces 15% of it with milk twice. Then, he replaces 10 percent of the resultant solution with more milk.What is the final concentration of tea John drinks?Answer Choices:(a) 15.38%(b) 42%(c) 39.86%(d) 22.35%(e) 32.51%","target":"(e)"}
{"input":"In a class 1\/16 of the students study math, 1\/10 of the students study bio, 1\/8 of the students study english. The total number of students is a 4 digit number. Find the diffrence between maximum number of students and minimum number of students.Answer Choices:(a) 8880(b) 8870(c) 8890(d) 7890(e) 6780","target":"(a)"}
{"input":"On a normal day Bill usually averages about 15 mph when riding his bicycle. On a windy day, his speed is reduced by 4 mph. How far can Bill travel on a windy day in 21 minutes? Round to the nearest hundredth.Answer Choices:(a) 2 miles(b) 2.25 miles(c) 3.25 miles(d) 3.85 miles(e) 2.85 miles","target":"(d)"}
{"input":"A retailer sold an appliance for 40 percent above cost, which represented a gross profit of $20.00. For what price did the retailer sell the appliance?Answer Choices:(a) $27.30(b) $51.00(c) $63.00(d) $70.00(e) $91.00","target":"(d)"}
{"input":"At 6% per annum simple interest, Rahul borrowed Rs. 500. What amount will he pay to clear the debt after 4 yearsAnswer Choices:(a) 750(b) 700(c) 620(d) 600(e) None of these","target":"(c)"}
{"input":"A computer routine was developed to generate two numbers (x,y) the first being a random number between 0 and 100 inclusive, and the second being less than or equal to the square root of the first. Each of the following pair satisfies the routine exceptAnswer Choices:(a) (99,10(b) (85,9(c) (50,7(d) (1,1(e) (1,0","target":"(a)"}
{"input":"A jeep travels a certain distance taking 6 hours in the forward journey. During the return journey, it increased its speed by 12km\/hr and took 4 hours. What is the distance travelled by the jeep?Answer Choices:(a) 126km(b) 144km(c) 127km(d) 228km(e) 128km","target":"(b)"}
{"input":"When I was 2 years old, my brother was half my age. Now I am 60 years old, how old is my brother?Answer Choices:(a) A(b) B(c) C(d) D(e) E","target":"(a)"}
{"input":"The original retail price of an appliance was 60 percent more than its wholesale cost. If the appliance was actually sold for 20 percent less than the original retail price, then it was sold for what percent more than its wholesale cost?Answer Choices:(a) 20%(b) 28%(c) 36%(d) 40%(e) 42%","target":"(b)"}
{"input":"On a map, the length of the road from Town F to Town G is measured to be 20 inches. On this map, 1\/4 inch represents an actual distance of 10 miles. What is the actual distance, in miles, from Town F to Town G along this road?Answer Choices:(a) 800(b) 720(c) 960(d) 1140(e) 1160","target":"(a)"}
{"input":"When folded into two equal halves a rectangular sheet had a perimeter of 48cm for each part folded along one set of sides and the same is 66cm when folded along the other set of sides. Find the area of the sheet.Answer Choices:(a) 1584(b) 1120(c) 792(d) 1320(e) 1200","target":"(b)"}
{"input":"Suppose you can travel from a place M to a place N by 3 buses, from place N to place O by 4 buses, from place O to place P by 1 buses and from place P to place Q by 3 buses. In how many ways can you travel from M to Q ?Answer Choices:(a) 24(b) 36(c) 72(d) 84(e) None","target":"(b)"}
{"input":"A rectangular solid, 3 x 4 x 15, is inscribed in a sphere, so that all eight of its vertices are on the sphere. What is the diameter of the sphere?Answer Choices:(a)  13.3542(b)  15.8113(c)  18.3451(d)  19.5667(e)  20.8888","target":"(b)"}
{"input":"A starts travel towards south 3km, then travel 5 km towards east, and again travels 3 km to north, and finally travels 2km towards west. In the end how far from is A from home?Answer Choices:(a) 3km(b) 2km(c) 4km(d) 5km(e) 6km","target":"(a)"}
{"input":"While selling a watch, a shopkeeper gives a discount of 5%. If he gives a discount of 7%, he earns Rs. 15 less as profit. The marked price of the watch is:Answer Choices:(a) Rs. 697.50(b) Rs. 712.50(c) Rs. 787.50(d) Rs. 750(e) Rs. 780","target":"(d)"}
{"input":"A student instead of finding the value of 7\/8 of a number, found the value of 7\/18 of the number. If his answer differed from the actual one by 770, find the that number.Answer Choices:(a) 1584(b) 2520(c) 1728(d) 1656(e) None","target":"(a)"}
{"input":"The monthly salary S of a shop assistant is the sum of a fixed salary of $500 plus 5% of all monthly sales. What should the monthly sales be so that her monthly salary reaches $1500?Answer Choices:(a) $50000(b) $40000(c) $30000(d) $20000(e) None of these","target":"(d)"}
{"input":"An aeroplane flies along the four sides of a square at the speeds of 200, 400, 600 and 800km\/hr. Find the average speed of the plane around the field?Answer Choices:(a) 384(b) 562(c) 458(d) 156(e) 452","target":"(a)"}
{"input":"Jack buys 18 sharpeners (white and brown) for rs. 100. If he pays 1 rupee more for each white than brown sharpeners. How many of white and how many brown sharpeners did he buy?Answer Choices:(a) 10,8(b) 9,8(c) 7,8(d) 5,6(e) 11,12","target":"(a)"}
{"input":"Hoses A and B spout water at different constant rates, and hose A can fill a certain pool in 8 hours. Hose A filled the pool alone for the first 2 hours and the two hoses, working together, then finished filling the pool in another 3 hours. How many hours would it have taken hose B, working alone, to fill the entire pool?Answer Choices:(a) 8(b) 15(c) 12(d) 6(e) 3","target":"(a)"}
{"input":"If 120 is reduced to 96, what is the reduction percent?Answer Choices:(a) 30%(b) 40%(c) 20%(d) 10%(e) 5%","target":"(c)"}
{"input":"I know a 5 digit number having a property that with a 1 after it, it is three times as large as it would be with a 1 before it.What is that number?Answer Choices:(a) 42857(b) 32456(c) 76523(d) 24567(e) 43566","target":"(a)"}
{"input":"At Daifu university, 24% of all students are members of both a chess club and a swim team. If 20% of members of the swim team are not members of the chess club, what percentage of all Daifu students are members of the swim team?Answer Choices:(a) 20%(b) 30%(c) 40%(d) 50%(e) 60%","target":"(b)"}
{"input":"If the population of a city increases by 5 % annually, what will be the population of the city in 2 years time if its current population is 78000?Answer Choices:(a) 81900(b) 85995(c) 85800(d) 90000(e) None of these","target":"(b)"}
{"input":"Two cars start at the same time from opposite ends of a highway that is 50 miles long. One car is riding at 12 mph and the second car is riding at 13 mph. How long after they begin will they meet?Answer Choices:(a)  1(b)  1.25(c)  1.50(d)  1.75(e)  2","target":"(e)"}
{"input":"A shopkeeper employed a servant at a monthly salary of 1500. In addition to it, he agreed to pay him a commission of 15% on the monthly sale. How much sale in Rupees should the servant do if he wants his monthly income as 6000?Answer Choices:(a) 30000(b) 415000(c) 31500(d) 50000(e) None of these","target":"(a)"}
{"input":"A man borrows Rs.360 If he pays it back in 12 monthly installments of Rs.31.50, what is his interest rate?Answer Choices:(a) 1.5%(b) 4.5%(c) 10%(d) 5%(e) 12%","target":"(d)"}
{"input":"The price of a product is reduced by 30% . By what percentage should it be increased to make it 100%Answer Choices:(a) 41.86%(b) 42.86%(c) 43.86%(d) 44.86%(e) 45.86%","target":"(b)"}
{"input":"I have a money pouch containing Rs. 700. There are equal number of 25 paise coins, 50 paise coins and one rupee coins.How many of each are there?Answer Choices:(a) 453(b) 651(c) 400(d) 487(e) 286","target":"(c)"}
{"input":"A man spends Rs. 3500 per month and saves 12 1\/2% of his income. His monthly income is ?Answer Choices:(a) Rs. 4400(b) Rs. 4270(c) Rs. 4000(d) Rs. 3937.50(e) None of these","target":"(c)"}
{"input":"Five dozen toys are packed in a box and 98 boxes are kept in a tempo. How many tempos can lift 29400 toys in one round ?Answer Choices:(a) 4(b) 5(c) 7(d) 6(e) 8","target":"(b)"}
{"input":"There are 10 oranges in a basket. Find the no. of ways in which 2 oranges are chosen from the basket?Answer Choices:(a) 45(b) 90(c) 120(d) 150(e) 180","target":"(a)"}
{"input":"A company contracts to paint 3 houses. Mr.Brown can paint a house in 6 days while Mr.Black would take 8 days and Mr.Blue 12 days. After 8 days Mr.Brown goes on vacation and Mr. Black begins to work for a period of 6 days. How many days will it take Mr.Blue to complete the contract?Answer Choices:(a) 7(b) 8(c) 10(d) 11(e) 12","target":"(d)"}
{"input":"Train A leaves a station every 16 minutes and Train B leaves every 17 minutes. If both trains just left the station simultaneously, how long until they do so again?Answer Choices:(a) 272 minutes(b) 304 minutes(c) 190 minutes(d) 70 minutes(e) 35 minutes","target":"(a)"}
{"input":"A hollow cube of size 5cm is taken, with the thickness of 1cm. It is made of smaller cubes of size 1cm .If the outer surface of the cube is painted how many faces of the smaller cubes remain unpainted?Answer Choices:(a) 438(b) 550(c) 500(d) 450(e) 498","target":"(a)"}
{"input":"In a chocolate store, all chocolates are either vanilla or cocoa flavored only. 10% of the chocolates are cocoa flavored, 90% of the rest are squashed. What percentage of the chocolates are both vanilla flavored and not squashed?Answer Choices:(a) 1%(b) 2%(c) 5%(d) 9%(e) 10%","target":"(d)"}
{"input":"There is well of depth 30m and frog is at bottom of the well. He jumps 3m up one day and falls back 2m down the same day. How many days will it take for the frog to come out of the well?Answer Choices:(a) 25 days(b) 26 days(c) 27 days(d) 28 days(e) 29 days","target":"(d)"}
{"input":"The sum of the 5 consecutive two digit odd numbers when divided by 10 becomes a perfect square, which of the following can be one of these 5 numbers?Answer Choices:(a) 47(b) 91(c) 41(d) 67(e) 44","target":"(c)"}
{"input":"In a class, 8% of total students are interested in Football. 4\/5 of total students are interested in Cricket. 10% of total students are interested in Basketball and remaining 20 students are not interested in any games. How many students are there in the class?Answer Choices:(a) 850(b) 800(c) 900(d) 950(e) 1000","target":"(e)"}
{"input":"Q is as much younger than R as he is older than T. If the sum of the ages of R and T is 50 years. What is definitely the difference between R and Q's age?Answer Choices:(a) 22(b) 27(c) 29(d) Cannot be determined(e) None of the above","target":"(d)"}
{"input":"Calculate the maximum distance you can travel with $8.50 on a cab which charges $3.50 for the first quarter-mile and 10 cents for each additional quarter mile.Answer Choices:(a) 11.75 miles(b) 12.75 miles(c) 17.75 miles(d) 14.75 miles(e) 10.75 miles","target":"(b)"}
{"input":"In IPL season, Sachin current batting average is 51. In the finals, he scores 78 runs, then is batting average will be 54. Find out the total number of matches played by Sachin in this season.Answer Choices:(a) 6(b) 8(c) 9(d) 10(e) 11","target":"(c)"}
{"input":"Amy is organizing her bookshelves and finds that she has 10 different types of books. She then codes each book with either a single letter or a pair of two different letters. If each type of book is uniquely represented by either a single letter or pair of letters, what is the smallest number of letters Amy will need to create the codes for all 10 types of books? (Assume the order of letters in a pair does not matter.)Answer Choices:(a) 3(b) 4(c) 5(d) 10(e) 20","target":"(d)"}
{"input":"A rectangular piece of 150 sq m has a length which is 1m more than the 4 times the breadth. What is the perimeter of the piece?Answer Choices:(a) 60 m(b) 61 m(c) 62 m(d) 63 m(e) 64 m","target":"(c)"}
{"input":"One gram of a certain health food contains 9 percent of the minimum daily requirement of vitamin E and 8 percent of the minimum daily requirement of vitamin A. If vitamins E and A are to be obtained from no other source, how many grams of the health food must be eaten daily to provide at least the minimum daily requirement of both vitamins?Answer Choices:(a) 8.5(b) 10.5(c) 12.5(d) 14.5(e) 16.5","target":"(c)"}
{"input":"Assistants are needed to prepare for preparation. Each helper can make either 2 large cakes or 35 small cakes\/hr. The kitchen is available for 3 hours and 20 large cakes & 700 small cakes are needed. How many helpers are required?Answer Choices:(a) 8(b) 10(c) 12(d) 15(e) 19","target":"(b)"}
{"input":"R, S, T, and U are points on a line, and U is the midpoint of line segment ST. If the lengths of line segments RS, RT, and ST are 5, 17, and 22, respectively. What is the length of line segment RU?Answer Choices:(a) 6(b) 7(c) 8(d) 9(e) 10","target":"(a)"}
{"input":"Six pita breads contain the same amount of falafel as do two rolls. Three rolls contain the same amount of falafel as five baguettes do. Two baguettes contain the same amount of falafel as how many pita breads?Answer Choices:(a) 12\/25(b) 3\/2(c) 3(d) 2(e) 25\/3","target":"(c)"}
{"input":"A shopkeeper in order to promote his new shop put a discount of 20% on all the items for one day. Now he must sell the items at original price the other day. By what percentage must he increase the price to original?Answer Choices:(a) 21%(b) 20%(c) 25%(d) 33%(e) 18%","target":"(c)"}
{"input":"The bus fare for two persons for travelling between Agra and Aligarh id four-thirds the train fare between the same places for one person. The total fare paid by 6 persons travelling by bus and 8 persons travelling by train between the two places is Rs.1512. Find the train fare between the two places for one person?Answer Choices:(a) 126(b) 77(c) 88(d) 66(e) 54","target":"(a)"}
{"input":"A rectangle has a length of 8 centimeters and a width of 3 centimeters. Find the perimeter.Answer Choices:(a) 18cm(b) 22cm(c) 20cm(d) 30cm(e) 28cm","target":"(b)"}
{"input":"Suppose you want to arrange your English, Hindi, Mathematics, History, Geography and Science books on a shelf. In how many ways can you do it ?Answer Choices:(a) 520(b) 720(c) 920(d) None(e) Cannot be determined","target":"(b)"}
{"input":"A straight picket fence is composed of x pickets each of which is 1\/2 inch wide. If there are 6 inches of space between each pair of pickets, which of the following represents the length of fence in feet?Answer Choices:(a) 13x\/2(b) 13x\/2 - 6(c) 13x\/24(d) (13x+1(e) (13x-12","target":"(e)"}
{"input":"A ship went on a voyage. After it had traveled 180 miles a plane started with 10 times the speed of the ship. Find the distance when they meet from starting point.Answer Choices:(a) 238(b) 289(c) 200(d) 287(e) 187","target":"(c)"}
{"input":"In a large forest, 300 deer were caught, tagged, and returned during 2001. During 2002, 500 deer were caught at random, of which only 20 had tags from the previous year. If the percent of deer in the forest that had tags during the second year and were caught in the 500 deer sample is representative of the percent of the total deer population in the forest with tags, what is the total deer population in the forest (assuming no change in population between 2001 and 2002)?Answer Choices:(a) 300(b) 500(c) 5000(d) 6000(e) 7500","target":"(e)"}
{"input":"In a railway station, there are two trains going. One in the harbor line and one in the main line, each having a frequency of 10 minutes. The main line service starts at 5 o'clock and the harbor line starts at 5.02 A.M. A man goes to the station every day to catch the first train that comes. What is the probability of the man catching the first train?Answer Choices:(a) 0.9(b) 0.8(c) 0.6(d) 0.65(e) 1.5","target":"(b)"}
{"input":"The average (arithmetic mean) of the weight of 10 vehicles is 12.2 tons. The average weight of the group of vehicles increased by 2.6 tons after a new heavy duty truck was added to the group? What is the weight in tons of the heavy duty truck?Answer Choices:(a) 40.8(b) 41.6(c) 42.2(d) 43.5(e) 44.8","target":"(a)"}
{"input":"Boomtown urban planners expect the city’s population to increase by 10% per year over the next two years. If that projection were to come true, the population two years from now would be exactly double the population of one year ago. Which of the following is closest to the percent population increase in Boomtown over the last year?Answer Choices:(a) 20%(b) 40%(c) 50%(d) 65%(e) 75%","target":"(d)"}
{"input":"Arjun and Sajal are friends, each has some money. If Arun gives $30 to Sajal, the Sajal will have twice the money left with Arjun. But, if Sajal gives $10 to Arjun, Arjun will have thrice as much as is left with Sajal. How much money does each have?Answer Choices:(a) 62, 35(b) 62, 34(c) 34, 62(d) 42, 62(e) 62, 42","target":"(b)"}
{"input":"Julie’s yard is rectangular. One side of the yard is 100 feet wide. The total area of the yard is 3,000 square feet. What is the length of the other side of the yard?Answer Choices:(a) 30 feet(b) 20 feet(c) 10 feet(d) 50 feet(e) 60 feet","target":"(a)"}
{"input":"The greatest common factor of two positive integers is 11. The least common multiple of these two integers is 7700. If one of the integers is 350, what is the other?Answer Choices:(a) 242(b) 308(c) 352(d) 412(e) 456","target":"(a)"}
{"input":"A square piece of cloth is trimmed by 4 feet on one edge to form a rectangular piece, which is then cut diagonally in half to create two triangles. If the area of each of triangle is 70 square feet, what was the perimeter (in feet) of the original piece of square cloth?Answer Choices:(a) 56(b) 58(c) 60(d) 62(e) 64","target":"(a)"}
{"input":"The length of the ribbon was originally 30 cm. It was reduced in the ratio 5 : 3. What is its length now?Answer Choices:(a) 18(b) 30(c) 6(d) 15(e) 12","target":"(a)"}
{"input":"M = abc is a three digit number and N = cba, if M > N and M - N + 396c = 990. Then how many values of M are more than 300.Answer Choices:(a) 20(b) 30(c) 40(d) 200(e) None","target":"(a)"}
{"input":"there are more than 501 students in a school such that 20% of them exactly took physics and 28% of them exactly took math. What could be the least possible no of students in the school?Answer Choices:(a) 550(b) 570(c) 600(d) 700(e) none of these","target":"(e)"}
{"input":"If Raj was one-third as old as Rahim 5 years back and Raj is 17 years old now, How old is Rahim now?Answer Choices:(a) 37(b) 41(c) 40(d) 42(e) 43","target":"(b)"}
{"input":"A cow is tethered in the middle of a field with a 14 feet long rope. If the cow grazes 10 sq.ft. per day, then approximately what time will be taken by the cow to graze the whole field?Answer Choices:(a) 51 days(b) 61 days(c) 71 days(d) 81 days(e) 91 days","target":"(b)"}
{"input":"A book was sold for Rs 27.50 with a profit of 10%. If it were sold for Rs. 25.75, then would have been percentage of profit and loss ?Answer Choices:(a) 2% Profit(b) 3% Profit(c) 2% Loss(d) 3% Loss(e) 4% Loss","target":"(b)"}
{"input":"In how many ways can a teacher in a kindergarten school arrange a group of 3 children (Susan, Tim and Zen) on 3 identical chairs in a straight line so that Susan is on the left of Tim?Answer Choices:(a) 7(b) 3(c) 2(d) 1(e) 6","target":"(b)"}
{"input":"The telephone bill of a certain establishment is party fixed and partly varies as the number of calls consumed. When in a certain month 540 calls made the bill is Rs.1800. In another month 620 calls are consumed then the bill becomes Rs.2040. In another month 500 units are consumed due to moreholidays. The bill for that month would be :Answer Choices:(a) Rs.1560(b) Rs.1680(c) Rs.1840(d) Rs.1950(e) Rs.1690","target":"(b)"}
{"input":"Two balls A and B rotate along a circular track. Ball A makes 2 full rotations in 26 minutes. Ball B makes 5 full rotation in 35 minutes. If they start rotating now from the same point, when will they be at the same starting point again?Answer Choices:(a) 1 hour and 31 minutes(b) 2 hour and 31 minutes(c) 3 hour and 31 minutes(d) 4 hour and 31 minutes(e) 5 hour and 31 minutes","target":"(a)"}
{"input":"A bookshelf contains 45 books, 30 of which are hardcover and 20 of which are fiction. What is the maximum number of books that are both hardcover and fiction?Answer Choices:(a) 10(b) 15(c) 18(d) 20(e) 30","target":"(d)"}
{"input":"A newspaper costs $4 on Sunday and $1 the rest of the days of the week. If a hotel orders twice as many papers on Sunday as it does the rest of the days of the week and pays $210 per week for newspapers, how many newspapers does it buy on Monday?Answer Choices:(a) 15(b) 30(c) 45(d) 60(e) 75","target":"(a)"}
{"input":"A number of friends decided to go on a picnic and planned to spend Rs. 96 on eatables. Four of them, however, did not turn up. As a consequence, the remaining ones had to contribute Rs. 4 extra, each. The number of those who attended the picnic wasAnswer Choices:(a) 8(b) 12(c) 16(d) 24(e) 25","target":"(a)"}
{"input":"A wire in the shape of rectangle of length 27 cm and breadth 17 cm is rebent to form a square. What will be the measure of each side?Answer Choices:(a) 9(b) 11(c) 22(d) 25(e) 31","target":"(c)"}
{"input":"A man divides Rs 8600 among 5 sons, 4 daughters and 2 nephews. If each daughter receives four times as much as each nephew, and each son receives five as much as each nephew. How much does each daughter receive ?Answer Choices:(a) Rs 400(b) Rs 500(c) Rs 600(d) Rs 700(e) Rs 800","target":"(e)"}
{"input":"Silu and Meenu were walking on the road.Silu said, \"I weigh 51 Kgs. How much do you weigh?\"Meenu replied that she wouldn't reveal her weight directly as she is overweight.But she said, \"I weigh 29 Kgs plus half of my weight. \"How much does Meenu weigh?Answer Choices:(a) 12(b) 28(c) 27(d) 58(e) 91","target":"(d)"}
{"input":"Roy was suffering from severe headaches. He went to see his doctor and the doctor gave him 5 tablets asking him to take one tablet every 15 minutes.How much time will it take Roy to consume all the 5 tablets?Answer Choices:(a) 45 Min(b) 75 Min(c) 90 Min(d) 120 Min(e) 60 Min","target":"(e)"}
{"input":"In a bag of red and green sweets, the ratio of red sweets to green sweets is 3:4. If the bag contains 120 green sweets, how many red sweets are there?Answer Choices:(a) 90(b) 80(c) 95(d) 100(e) 85","target":"(a)"}
{"input":"A club consists of members whose ages are in A.P. The common difference being 3 months. If the youngest member of the club is just 7 years old and the sum of the ages of all the members is 250, then number of members in the club are :Answer Choices:(a) 18(b) 20(c) 25(d) 26(e) 27","target":"(c)"}
{"input":"M men agree to purchase a gift for Rs. D. If 3 men drop out how much more will each have to contribute towards the purchase of the gift?Answer Choices:(a) D\/(M-3(b) MD\/3(c) M\/(D-3(d) 3D\/(M2-3M(e) None of these","target":"(d)"}
{"input":"At what price should the Karan mark a sewing machine that costs him Rs. 1200\/- so that even after offering a 20% discount, he makes 20% profit?Answer Choices:(a) 1,879(b) 1,875(c) 1,876(d) 1,872(e) 1,800","target":"(e)"}
{"input":"Train ‘A’ leaves Mumbai Central for Lucknow at 11 am, running at the speed of 40 kmph. Train ‘B’ leaves Mumbai Central for Lucknow by the same route at 2 pm on the same day, running at the speed of 72 kmph. At what time will the two trains meet each other?Answer Choices:(a) 12 am on the next day(b) 5 am on the next day(c) 5 pm on the next day(d) 2 pm on the next day(e) None of these","target":"(a)"}
{"input":"Mark told John \"If you give me half your money I will have Rs.75. John said, \"if you give me one third of your money, I will have Rs.75\/-. How much money did John have ?Answer Choices:(a) 22(b) 60(c) 28(d) 26(e) 18","target":"(b)"}
{"input":"The number of water lilies on a certain lake doubles every two days. If there is exactly one water lily on the lake, it takes 60 days for the lake to be fully covered with water lilies. In how many days will the lake be fully covered with lilies, if initially there were 64 water lilies on it?Answer Choices:(a) 15(b) 28(c) 30(d) 53(e) 59","target":"(d)"}
{"input":"x men working x hours per day can do x units of a work in x days. How much work can be completed by y men working y hours per day in y days?Answer Choices:(a) x2\/y2 units(b) y3\/x2 units(c) x3\/y2 units(d) y2\/x2 units(e) None of these","target":"(b)"}
{"input":"ABCDE is a regular pentagon with F at its center. How many different quadrilaterals can be formed by joining 4 of the points A,B,C,D,E and F?Answer Choices:(a) 12(b) 10(c) 5(d) 15(e) 20","target":"(d)"}
{"input":"Points A, B, C, D lie in this order on the circumference of a circle. Minor arc AC is 160°, and minor arc BD is 150°. If B bisects minor arc AC, then what is the measure of minor arc AD?Answer Choices:(a) 80°(b) 130°(c) 140°(d) 160°(e) 220°","target":"(b)"}
{"input":"If 75 percent of the employees of a certain company take a winter vacation, 40 percent take a winter and a summer vacation, and 20 percent take neither a winter nor a summer vacation, what Q percent of the employees take a summer vacation but not a winter vacation?Answer Choices:(a) 5%(b) 15%(c) 25%(d) 35%(e) 45%","target":"(a)"}
{"input":"The cross-section of a canal is shaped like a trapezium. If the canal is 10 m wide at the top and 6 m wide at the bottom and the area of cross-section is 640 square meters, the depth of cannel is?Answer Choices:(a) 26(b) 28(c) 21(d) 80(e) 23","target":"(d)"}
{"input":"During one season, a tennis team won 20 matches and lost 30% of their matches. What was the number of matches that the team lost?Answer Choices:(a) 70(b) 30(c) 3(d) 7(e) 5","target":"(c)"}
{"input":"A point on the edge of a fan blade that is rotating in a plane 10 centimeters from the center of the fan. What is the distance traveled, in centimeters, by this point after 30 seconds when the fan runs at the rate of 300 revolutions per minutes?Answer Choices:(a) 750pi(b) 1500pi(c) 1875pi(d) 3000pi(e) 7500pi","target":"(d)"}
{"input":"If n is such that 36 ≤ n ≤ 72, then x = (n2 + 2√n(n + 4) + 16) \/ (n+ 4√n+ 4) satisfiesAnswer Choices:(a) 20 < x < 54(b) 23 < x < 58(c) 25 < x < 64(d) 28 < x < 60(e) None of these","target":"(d)"}
{"input":"At its maximum speed, a space shuttle can travel 700m high in 40 seconds. It will also take 5 seconds to pass a point. What then is the length of the space shuttle?Answer Choices:(a) 50 m(b) 75 m(c) 100 m(d) 125 m(e) 150 m","target":"(c)"}
{"input":"A starts a business with Rs.40,000. After 2 months, B joined him with Rs.60,000. C joined them after some more time with Rs.120,000. At the end of the year, out of a total profit of Rs.375,000, C gets Rs.150,000 as his share. How many months after B joined the business, did C join?Answer Choices:(a) 2 months(b) 4 months(c) 23 months(d) 24 months(e) 84 months","target":"(b)"}
{"input":"A paper is in a square form whose one side is 20 cm. Two semi circles are drawn on its opposites as diameters. If these semi circles are cut down what is the area of the remaining paper?Answer Choices:(a) 8.75(b) 8.79(c) 8.75(d) 8.71(e) 8.72","target":"(c)"}
{"input":"An athlete runs M miles in 4 hours, then rides a bike N miles in the same number of hours. Which of the following represents the average speed, in miles per hour, for these two activities combined?Answer Choices:(a) M + N \/ 8(b) 2M + N \/ 8(c) M + N \/ 4(d) M + 3N \/ 8(e) M + N \/ 5","target":"(a)"}
{"input":"8 man work for 6 days to complete a work. How many men are required to complete same work in 1\/2 day.Answer Choices:(a) 93 men(b) 94 men(c) 95 men(d) 96 men(e) 97 men","target":"(d)"}
{"input":"64 boys and 40 girls form a group for social work. During their membership drive, the same number of boys and girls joined the group. How many members does the group have now, if the ratio of boys to girls is 4:3?Answer Choices:(a) 277(b) 288(c) 200(d) 277(e) 168","target":"(e)"}
{"input":"A cyclist travels at 12 miles per hour. How many minutes will it take to travel 48 miles?Answer Choices:(a) 1(b) 240(c) 30(d) 60(e) 120","target":"(b)"}
{"input":"Kevin drove from A to B at a constant speed of 70 mph. Once he reached B, he turned right around with pause, and returned to A at a constant speed of 90 mph. Exactly 3 hours before the end of his trip, he was still approaching B, only 70 miles away from it. What is the distance between A and B?Answer Choices:(a) 180(b) 90(c) 270(d) 360(e) None of the above","target":"(a)"}
{"input":"30 is subtracted from a number, it is reduced to its one third. What is the value of 50% of that number?Answer Choices:(a) 22.5(b) 84(c) 21(d) 24(e) 25","target":"(a)"}
{"input":"If a man rows at the rate of 4 kmph in still water and his rate against the current is 2 kmph, then the man's rate along the current is:Answer Choices:(a) 15 kmph(b) 6 kmph(c) 12 kmph(d) 14 kmph(e) 6 kmph","target":"(e)"}
{"input":"The sum of the digits of a three digit number is 17, and the sum of the squares of its digits is 109. If we subtract 495 from the number, we shall get a number consisting of the same digits written in the reverse order. Find the number.Answer Choices:(a) 368(b) 377(c) 288(d) 997(e) 112","target":"(a)"}
{"input":"X and Y are two alloys which were made by mixing zinc and copper in the ratio 6:9 and 7:11, respectively. If 40 grams of alloy X and 60 grams of alloy Y are melted and mixed to form alloy Z, what is the ratio of zinc and copper in the alloy Z ?Answer Choices:(a) 69:91(b) 59:91(c) 59:90(d) 59:91(e) 69:101","target":"(b)"}
{"input":"The nefarious bandit Hoopsmot decides to go in with his criminal partner Smolapon to purchase a number of senators. Hoopsmot contributes $16,000 to their bribery pool, and Smolapon contributes just $4,000. Their total allows them to influence 30 senators. How many senators of these can be considered Hoopsmot's?Answer Choices:(a) 18(b) 20(c) 22(d) 24(e) 26","target":"(d)"}
{"input":"The difference between the squares of two numbers is 256000 and the sum of the numbers is 1000. The numbers areAnswer Choices:(a) 600, 400(b) 628, 372(c) 640, 360(d) None of these(e) Cannot be determined","target":"(b)"}
{"input":"An astronaut weighing 211 pounds on Earth would weigh 182 pounds on Venus. The weight of the astronaut on Venus would be approximately what percent of the astronaut’s weight on Earth?Answer Choices:(a) 50%(b) 60%(c) 70%(d) 86%(e) 90%","target":"(d)"}
{"input":"A man walks at 5 kmph for 6 hrs and at 4 kmph for 12 hrs. His average speed isAnswer Choices:(a) 4 1\/3 km\/h(b) 7 2\/3 km\/h(c) 9 ½ km\/h(d) 8 km\/h(e) 81 km\/h","target":"(a)"}
{"input":"[(272 - 32) (124 + 176)] \/ (17 x 15 - 15) = ?Answer Choices:(a) 0(b) 2.25(c) 300(d) 400(e) None of these","target":"(c)"}
{"input":"Everyone in the family earns money each month. If the total income of a family per month is $9000 and the median income is $3000, how many members are there in the family?Answer Choices:(a) 2(b) 3(c) 4(d) 5(e) 6","target":"(b)"}
{"input":"The bus fare of one adult is Rs. 140 from Ranchi to Patna and bus fare of a child is half the fare of one adult between the same places. What is the total bus fare of 4 adults and 3 children between same places?Answer Choices:(a) Rs. 666(b) Rs. 670(c) Rs. 700(d) Rs. 570(e) Rs. 770","target":"(e)"}
{"input":"An organization decided to raise Rs. 6 lakh by collecting equal contribution from each of its employees. If each of them had contributed Rs. 60 extra, the contribution would have been Rs. 6.24 lakh. How many employees are there in that organization?Answer Choices:(a) 300(b) 200(c) 400(d) 100(e) 500","target":"(c)"}
{"input":"If there are 5,000 voters out of which 20% are not eligible to vote and there are two candidates contesting. The winning candidate won by 15% of the votes. What is the total number of votes he got ?Answer Choices:(a) 3267(b) 2678(c) 2797(d) 2300(e) 2781","target":"(d)"}
{"input":"For bringing each copper coin from the bottom of a river, a coin-diver gets 20 cents, and for each brass coin she gets 25 cents. If after one dive, she got $3.40. What is the minimum number of copper coins that she brought?Answer Choices:(a) 4(b) 3(c) 2(d) 1(e) 0","target":"(c)"}
{"input":"Ram and Krishna start from A and B, respectively, at the same time and travel towards each other at constant speeds of 20m\/s and 40m\/s, respectively, along the same route. Ram meets Krishna at point C on the road after 10 seconds. Find the total distance between A to B.Answer Choices:(a) 700 meters(b) 1000 meters(c) 700 kilometers(d) 555 meters(e) 600 meters","target":"(e)"}
{"input":"Car ‘X’ covers a distance of 320 kms in 8 hours and car ‘Y’ covers a distance of 415 kms in 5 hrs. What is the difference in the speed of the two cars?Answer Choices:(a) 42kms\/hr(b) 41km\/hr(c) 43kms\/hr(d) 45kms\/hr(e) None of these","target":"(c)"}
{"input":"Winson runs from his home to his school at an average speed of 10 miles\/hr, and then walks home along the same route at an average speed of 5 miles\/hr. If the whole journey took one hour, how many miles is his home from his school?Answer Choices:(a) 9(b) 6(c) 4(d) 3(e) 2","target":"(e)"}
{"input":"A sporting goods store carries only yellow and white golf balls. At the beginning of the day it had 600 golf balls in stock, and by the end of the day it had sold 80% of its inventory of golf balls. If the store sold an equal number of yellow and white golf balls, and in doing so sold all of its white golf balls, how many yellow golf balls did the store have to begin the day?Answer Choices:(a) 80(b) 120(c) 240(d) 320(e) 360","target":"(e)"}
{"input":"A flagstaff 17.5 metre high casts a shadow of length 40.25 metre. The height of building, which casts a shadow of length 28.75 metre under similar conditions will be :Answer Choices:(a) 12 metre(b) 12.5 metre(c) 13.5 metre(d) 14 metre(e) 15 metre","target":"(b)"}
{"input":"Two cars are travelling from the same starting point in the same direction, having started their commute at the same time. The first car travels at a steady rate of 55 mph, while the second travels at a steady rate of 52 mph. How much time will pass before the cars are 15 miles away from each other?Answer Choices:(a) 3 hours(b) 5 hours(c) 6 hours(d) 4 hours(e) 7 hours","target":"(b)"}
{"input":"The events A and B are independent. The probability that event A occurs is 0.6, and the probability that at least one of the events A or B occurs is 0.96. What is the probability that event B occurs?Answer Choices:(a) 0.5(b) 0.6(c) 0.7(d) 0.8(e) 0.9","target":"(e)"}
{"input":"The ratio of the volumes of a cube to that of the sphere which will fit inside the cube is?Answer Choices:(a) 2: π(b) 7:2(c) 8:2(d) 6: π(e) 8:3","target":"(d)"}
{"input":"My wall contains 8 red colour ties, 13 violet colour ties,10 blue colour ties, 5 pink colour ties, 4 green colour ties. If electricity is gone and I want at least two ties of same colour then how many ties I should take out from my rack?Answer Choices:(a) 2(b) 3(c) 4(d) 5(e) 6","target":"(e)"}
{"input":"Find 25\/12*5Answer Choices:(a) 2.5498(b) 0.4167(c) 3.3987(d) 8.5497(e) 5.6312","target":"(b)"}
{"input":"The value of log2 4 is:Answer Choices:(a) 2(b) 4(c) 6(d) 8(e) 12","target":"(a)"}
{"input":"Calculate the percentage gain of a merchant who purchased 90 kg of oranges for Rs. 450 and sold the whole lot at the rate of Rs. 7.50 per kg.Answer Choices:(a) 50 %(b) 60 %(c) 55 %(d) 70 %(e) 58%","target":"(a)"}
{"input":"A train M leaves City A at 5 am and reaches City B at 9am. Another train N leaves City B at 7am and reaches City A at 1030am. At what time do the 2 trains cross one another?Answer Choices:(a) 1 hr 23 min(b) 1 hr 15 min(c) 1 hr 8 min(d) 56 min(e) 55 min","target":"(d)"}
{"input":"Janice bikes at 10 miles per hour, while Jennie bikes at 20. How long until they have collectively biked 1 mile?Answer Choices:(a) 1 minute(b) 2 minutes(c) 3 minutes(d) 4 minutes(e) 5 minutes","target":"(b)"}
{"input":"In an exam, a candidate secured 504 marks of the maximum mark of M. If the maximum mark M is converted into 800 marks, he would have secured 420 marks. What is the value of M?Answer Choices:(a) 278(b) 2890(c) 270(d) 2702(e) 960","target":"(e)"}
{"input":"If Jill needed to buy 10 bottles of soda for a party in which 8 people attended, how many bottles of soda will she need to buy for a party in which 12 people are attending?Answer Choices:(a) 6(b) 8(c) 10(d) 12(e) 14","target":"(c)"}
{"input":"Two ants are standing side-by-side. One ant, which is 4 inches tall, casts a shadow that is 10 inches long. The other ant is 6 inches tall. Compute, in inches, the length of the shadow that the taller ant casts.Answer Choices:(a) 36(b) 28(c) 42(d) 15(e) 20","target":"(d)"}
{"input":"The height of a room to its semi-perimeter is 2:5. It costs Rs.260 to paper the walls of the room with paper 50cm wide at Rs.2 per meter allowing an area of 15 sq.m for doors and windows. The height of the room is:Answer Choices:(a) 2.6m(b) 3.9m(c) 4m(d) 4.2m(e) 4.4m","target":"(c)"}
{"input":"The sum of k consecutive integers is 51. If the least integer is -50, then k =Answer Choices:(a) 40(b) 62(c) 82(d) 92(e) 102","target":"(e)"}
{"input":"In a survey of students, each student selected from a list of 10 songs the 2 songs that the student liked best. If each song was selected 5 times, how many students were surveyed?Answer Choices:(a) 96(b) 48(c) 32(d) 25(e) 18","target":"(d)"}
{"input":"If one of the roots of the quadratic equation x^2 + mx + 22 = 0 is 1.5, then what is the value of m?Answer Choices:(a) -23.5(b) -17.5(c) -10.5(d) -16.2(e) Cannot be determined","target":"(d)"}
{"input":"At an election meeting 10 speakers are to address the meeting. The only protocol to be observed is that whenever they speak the pm should speak before the mp and the mp should speak before the mla. In how many ways can the meeting be held?Answer Choices:(a) 10!\/3(b) 10!\/6(c) 10!\/2(d) 10!\/4(e) 10!\/5","target":"(b)"}
{"input":"Anna is able to buy 5 more articles for $300 after the price of each article decreased by 15%. What is the new selling price of each article?Answer Choices:(a) $8(b) $10(c) $13.6(d) $22.9(e) $40","target":"(c)"}
{"input":"In a row of children Neha is 12th from left end and Radha is 6th from right end. When Radha is shifted to left by 2 places and Neha is shifted to right by 2 places there 6 children between Radha and Neha. How many children are there in the row?Answer Choices:(a) 23(b) 27(c) 26(d) 28(e) 29","target":"(d)"}
{"input":"10kg of a mixture contains 30% sand and 70% clay. In order to make the mixture contain equal quantities of clay and sand how much of the mixture is to be removed and replaced with pure sand?Answer Choices:(a) 10\/7(b) 20\/7(c) 30\/7(d) 40\/7(e) 50\/7","target":"(b)"}
{"input":"A man spends 70% of his income. If his income increases by 20%, then what will be his new expenditure?Answer Choices:(a) 58.3%(b) 62.5%(c) 63.5%(d) 64.5%(e) 65.5%","target":"(a)"}
{"input":"What is the greatest number of identical bouquets that can be made out of 28 white and 98 red tulips if no flowers are to be left out? (Two bouquets are identical whenever the number of red tulips in the two bouquets is equal and the number of white tulips in the two bouquets is equal.)Answer Choices:(a) 4(b) 7(c) 10(d) 14(e) 21","target":"(d)"}
{"input":"Sharon works for 5 hours to earn enough tips to buy an ice cream cake, while Karen works for 4. After how many hours will they be able to buy the cake together?Answer Choices:(a) 1 hour(b) 2 hours(c) 3 hours(d) 4 hours(e) 5 hours","target":"(c)"}
{"input":"If x<0, y>0, and |x^3| > |y^2|, which of the following must be true?Answer Choices:(a) x > y(b) y^2 > x^2(c) -x^3 < y^2(d) –x < y(e) x < –y","target":"(b)"}
{"input":"Printer A and Printer B can each print 1⁄2 page per second. How long will it take both printers working together to print 100 pages?Answer Choices:(a) 25 seconds(b) 50 seconds(c) 100 seconds(d) 200 seconds(e) 400 seconds","target":"(c)"}
{"input":"Two ants are moving from their farms towards each other. Ant A is moving at a speed of 9 cm per hour and ant B is moving at a speed of 6 cm per hour. If the farms are 75 cm away from each other, what will be the distance (in cm) that ant A travels until meeting ant B?Answer Choices:(a) 45(b) 48(c) 51(d) 54(e) 57","target":"(a)"}
{"input":"Roberts has a property worth of $1023.65. But in a record his property worth is written as greatest positive even integer less than or equal to his property worth and it is divisible by 100. Find the difference between actual property and recorded property worth?Answer Choices:(a) 23.65(b) 1000(c) 35.62(d) 2.65(e) 1023.65","target":"(a)"}
{"input":"A man spend 810 in buying trouser at Rs 70 each and shirt at 30 each. What will be the ratio of trouser and shirt when the maximum number of trouser is purchased?Answer Choices:(a) 9 Trousers(b) 8 Trousers(c) 10 Trousers(d) 7 Trousers(e) 11 Trousers","target":"(a)"}
{"input":"If a subscription for 15 issues of a magazine costs $42.00 and represents a saving of 25 percent of the cover prices, what is the cover price per issue?Answer Choices:(a) $7.73(b) $6.73(c) $5.73(d) $4.73(e) $3.73","target":"(e)"}
{"input":"Christopher and Jonathan were having bets. They decide that a coin will be flipped twenty times and each time it turns heads, Christopher will give $2 to Jonathan and each time it turns out to be Tails, Jonathan will give 3$ to Christopher. After flipping for twenty times none of the both won or lost any amount.How many times did the coin landed on Heads ?Answer Choices:(a) 10(b) 23(c) 16(d) 18(e) 12","target":"(e)"}
{"input":"Allen starts from X, goes to Y. At the same time Bob starts from Y and goes towards X. Once Allen reaches Y he changes his direction and returns to X. Once Bob reaches X, he changes his direction and returns to Y. Throughout Allen travels at 54 kmph and Bob travels at 78kmph. By the time they meet for the second time, Bob covers 48 km more than Allen. Find the distance between X and Y.Answer Choices:(a) 144km(b) 72 km(c) 126km(d) 84 km(e) 48km","target":"(e)"}
{"input":"Tires of a certain brand, when purchased new, last for four years. A customer can choose to purchase the new tires at a cost of $180 per tire or can have his current tires repaired at a cost of $40 per tire, a repair that will make the current tires last for one additional year. The average cost per year of the new tires is what percent greater than the cost of repairing the current tires?Answer Choices:(a) 8%(b) 10%(c) 12.5%(d) 16.7%(e) 25%","target":"(c)"}
{"input":"A rope 20 meters long is cut into two pieces. If the length of one piece of rope is 3 meters shorter than the length of the other, what is the length, in meters, of the longer piece of rope?Answer Choices:(a) 7.5(b) 8.9(c) 9.9(d) 11.5(e) 11.7","target":"(d)"}
{"input":"Jerry purchased a 1-year $5,000 bond that paid an annual interest rate of 12% compounded every six months. How much interest had this bond accrued at maturity?Answer Choices:(a) $5102(b) $618(c) $216(d) $202(e) $200","target":"(b)"}
{"input":"Decipher the following multiplication table:M A DB E-------------M A DR A E-------------A M I DAnswer Choices:(a) 9 2 0 0(b) 9 2 0 9(c) 9 2 0 1(d) 9 2 0 7(e) 9 2 2 2","target":"(d)"}
{"input":"Sachin was twice as old as Ajay 10 years back. How old is Ajay today if Sachin will be 40 years old in 10 yearsAnswer Choices:(a) 18(b) 25(c) 15(d) 20(e) 21","target":"(d)"}
{"input":"What will be the cost of gardening 1-metre – broad boundary around a rectangular plot having perimeter of 340 metres at the rate of 10 per square metre?Answer Choices:(a) 3400(b) 1700(c) 3440(d) Cannot be determined(e) None of these","target":"(c)"}
{"input":"Last year, 34 percent of Ace Book Company's sales revenue came from the sale of novels. Of the remaining revenue, 1\/3 was from the sale of biographies. The company's revenue from the sale of novels was approximately, how many times its revenue from the sale of biographies?Answer Choices:(a) 1.3(b) 1.5(c) 2.1(d) 2.5(e) 3.1","target":"(b)"}
{"input":"A bee bypasses 0.05% of flowers it flies by because it can sense they don't have any nectar in them. How many flowers will the bee fly by to bypass 8 flowers?Answer Choices:(a) 2000(b) 4000(c) 8000(d) 16000(e) 32000","target":"(d)"}
{"input":"Fernando purchased a university meal plan that allows him to have a total of 3 lunches and 3 dinners per week. If the cafeteria is closed on weekends and Fernando always goes home for a dinner on Friday nights, how many options does he have to allocate his meals?Answer Choices:(a) 5C3*4C3(b) 5C4*4C2(c) 5C2*4C4(d) 5C6*4C5(e) 4C3*4C3","target":"(a)"}
{"input":"What should come in place of the question mark(?) in each of the following questions ?a2 - b2\/(a + b)2 (?)=(a - b)2Answer Choices:(a) (a + b(b) (a - b(c) (a + b(d) a3 + b3(e) None of these","target":"(a)"}
{"input":"A number is as much greater than 36 as is less than 86. Find the Number.Answer Choices:(a) 60(b) 56(c) 51(d) 61(e) 41","target":"(d)"}
{"input":"A certain phone manufacturer ships its products in crates. A crate consists of p pallets, and each pallet holds 1250 phones. If the manufacturer ships 4 crates, how many phones are shipped?Answer Choices:(a) 1000p(b) 1500p(c) 2000p(d) 2500p(e) 30000","target":"(d)"}
{"input":"A can construct a wall in 40 min and B can construct the wall in 45 min. How many hours is needed to contruct a wall if both the person working together.Answer Choices:(a) 20 min(b) 22 min(c) 23 min(d) 21 min(e) 20 min","target":"(d)"}
{"input":"An express electric train takes exact three seconds to enter tunnel which is 1 mile long.If train is traveling at 120 mile an hour, how long will it take to pass completely through the tunnel ?Answer Choices:(a) 43 seconds(b) 39 seconds(c) 20 seconds(d) 33 seconds(e) 55 seconds","target":"(d)"}
{"input":"A merchant receives an invoice for a motor boat for $20 000 with terms 4\/30, n\/100. What is the highest simple interest rate at which he can afford to borrow money in order to take advantage of the discount?Answer Choices:(a) 247.67(b) 237.67(c) 227.67(d) 215.67(e) None of these","target":"(a)"}
{"input":"There are ten lime soda bottles on a table in a restaurant. They are to be served among two different groups of customers consisting of 5 members each. How many ways are there to create these 2 groups?Answer Choices:(a) 90(b) 105(c) 126(d) 252(e) 525","target":"(d)"}
{"input":"A special cereal mixture contains rice, wheat and corn in the ratio of 2:3:5. If a bag of the mixture contains 3 pounds of rice, how much corn does it contain?Answer Choices:(a) 6.5(b) 7.5(c) 7(d) 6(e) None of the above","target":"(b)"}
{"input":"You can purchase one soda and two energy bars for 150 cents, or two sodas and three energy bars for 300cents. If the costs of the items do not change, compute the cost in cents of six sodas and seven bars.Answer Choices:(a) 500(b) 600(c) 750(d) 800(e) 900","target":"(e)"}
{"input":"A pen company produces very fine quality of writing pens. Company knows that on average 10% of the produced pens are always defective so are rejected before packing. Company promises to deliver 7200 pens to its wholesaler at Rs. 10 each. It estimates the overall profit on all the manufactured pens to be 25%. What is the manufactured cost of each pen?Answer Choices:(a) Rs. 6(b) Rs. 7.2(c) Rs. 5.6(d) Rs. 8(e) None of these","target":"(b)"}
{"input":"A two digit number exceeds the sum of the digits of that number by 18. If the digit at the unit's place is double the digit in the ten's place, what is the number?Answer Choices:(a) 12(b) 24(c) 42(d) 48(e) 49","target":"(b)"}
{"input":"Suppose for any real number x, [x] denotes the greatest integer less than or equal to x. Let L(x,y) = [x] + [y] + [x + y] and R(x,y) = [2x] + [2y]. Then it is impossible to find any two positive real numbers x and y for whichAnswer Choices:(a) L(x,y(b) L(x,y(c) L(x,y(d) L(x,y(e) None","target":"(d)"}
{"input":"Three bells ring at intervals of 36 seconds, 40 seconds and 48 seconds, respectively. They start ringing together at a particular time. When they will ring together again?Answer Choices:(a) After 6 minutes(b) After 12 minutes(c) After 18 minutes(d) After 24 minutes(e) none","target":"(b)"}
{"input":"An electric pole, 14 metres high, casts a shadow of 10 metres. Find the height of a tree that casts a shadow of 15 metres under similar conditions.Answer Choices:(a) 21(b) 22(c) 20(d) 23(e) 24","target":"(a)"}
{"input":"At my favorite fruit stand, an orange costs 18 dollars, a pineapple costs 27 dollars, and a grape costs 15 dollars. Using the same logic, can you tell how much a mango costs?Answer Choices:(a) 22 dollars(b) 15 dollars(c) 20 dollars(d) 18 dollars(e) 10 dollars","target":"(b)"}
{"input":"In the coordinate plane, a triangle has vertices at (a,0), (b,0), and (x,y). If a>x>b>0>y, which of the following represents the area of that triangle?Answer Choices:(a) (ay−by(b) (ab−ay(c) (by−ay(d) (ay+by(e) (a−b","target":"(c)"}
{"input":"A car finishes a journey in 20 hours at the speed of 60 km\/hr. If the same distance is to be covered in 10 hours, how much speed does the car gain?Answer Choices:(a) 80 kmph(b) 50 kmph(c) 120 kmph(d) 70 kmph(e) 80 kmph","target":"(c)"}
{"input":"Three friends Alan, Roger and Peter attempt to answer a question on an exam. Alan randomly guesses the answer, giving him a 1\/5 probability of guessing correctly. Roger cheats by looking at the paper of the student in front of him, giving him a 2\/3 probability of answering correctly. And Peter dutifully performs the calculations, then marks the answer, giving him a 5\/6 probability of a correct answer. What is the probability that the question is answered correctly, but not via cheating?Answer Choices:(a) 1\/18(b) 1\/9(c) 23\/90(d) 5\/18(e) 13\/45","target":"(a)"}
{"input":"The difference between simple interest and C.I. at the same rate for Rs.5000 for 2 years in Rs.72. The rate of interest is?Answer Choices:(a) 10%(b) 12%(c) 6%(d) 8%(e) 4%","target":"(b)"}
{"input":"All 250 files on Sam's hard drive are infected by either a virus or a worm or both. The number of files that are infected only by a worm is 2.5 times the number of files that are infected by both a virus and a worm. If 50% of the files were not infected by a virus, how many of Sam's files were NOT infected by a worm?Answer Choices:(a) 50(b) 70(c) 75(d) 100(e) 125","target":"(c)"}
{"input":"A father wants to divide Rs. 5100 between his two sons, Mohan and Sohan who are 23 and 24 at present. He divides the amount in such a way that if their shares are invested at compound interest at 4% p.a. they will receive equal amount on attaining the age of 26 years. Find Mohan's share.Answer Choices:(a) 2400(b) 2500(c) 2600(d) 2700(e) None of these","target":"(b)"}
{"input":"What is 60% of 30% of 1400 grams?Answer Choices:(a) 450 gms(b) 100 gms(c) 252 gms(d) 240 gms(e) None of these","target":"(c)"}
{"input":"A certain liquid passes through a drain at a rate of w\/25 gallons every x seconds. At that rate, how many minutes will it take y gallons to pass through the drain?Answer Choices:(a) y\/(1200xy(b) 20xy\/w(c) 5xy\/(12w(d) w\/(3xy(e) 3y\/(wx","target":"(c)"}
{"input":"A coin made of alloy of aluminum and silver measures 2 x 15 mm (it is 2 mm thick and its diameter is 15 mm). If the weight of the coin is 30 grams and the volume of aluminum in the alloy equals that of silver, what will be the weight of a coin measuring 1 x 30 mm made of pure aluminum if silver is twice as heavy as aluminum?Answer Choices:(a) 36 grams(b) 40 grams(c) 42 grams(d) 48 grams(e) 50 grams","target":"(b)"}
{"input":"If 10 is subtracted from 2\/3 of a number the result is equal to sum of 40 and 1\/3 of the number. Find the numberAnswer Choices:(a) 100(b) 160(c) 150(d) 210(e) 220","target":"(c)"}
{"input":"What is the largest integral value of 'k' for which the quadratic equation x2 - 5x + k = 0 will have two real and distinct roots?Answer Choices:(a) 9(b) 7(c) 3(d) 8(e) 12","target":"(c)"}
{"input":"900 + 5 × 12 = ?Answer Choices:(a) 820(b) 202(c) 420(d) 209(e) 960","target":"(e)"}
{"input":"Shweta rides at the rate of 10 km per hour but stops for 10 minutes to take rest at the end of every 15 km. How many hours will she take to cover 100 kmAnswer Choices:(a) 9 hours.(b) 10 hours.(c) 11 hours.(d) 12 hours.(e) 13 hours.","target":"(c)"}
{"input":"Mr.Sam takes 17 hours to go by train to a certain city and return by car. He loses 4 hours if he goes both ways by train. How long would he have taken if he had traveled by car in both ways?Answer Choices:(a) 22 hrs(b) 18 hrs(c) 16 hrs(d) 20 hrs(e) 13 hrs","target":"(e)"}
{"input":"Jim filled his dog's bowl with dog food. Starting at 8:00 am, Jim's dog ate exactly once an hour, consuming exactly 1\/3 of the dog food remaining in the bowl at each feeding session. Approximately, what percent of the original food was in the dog's bowl right before the dog began to eat at noon of the same day?Answer Choices:(a) 20%(b) 25%(c) 30%(d) 35%(e) 40%","target":"(a)"}
{"input":"John conducted a survey about car color. 60% of the people who took the survey were women. Of the men who were surveyed, 75% preferred red cars over green cars. If 10 men liked green cars more than red, how many people took the survey?Answer Choices:(a) 100(b) 120(c) 50(d) 200(e) 80","target":"(a)"}
{"input":"How many ways A boy can reach the top of stairs which contain 10 steps, when he can take either one or two steps every time?Answer Choices:(a) 88(b) 89(c) 90(d) 91(e) 92","target":"(b)"}
{"input":"IF one gallon of soft drink is made of 40% orange juice and 60% water, how many additional gallons of orange juice must be mixed in order to make the orange juice 60% of the soft drink?Answer Choices:(a) 0.5(b) 1(c) 1.25(d) 1.5(e) 2","target":"(a)"}
{"input":"What is the units digit of 9^3-7?Answer Choices:(a) 1(b) 3(c) 5(d) 2(e) 4","target":"(d)"}
{"input":"5 horses are in a race. Mr.Jain selects two of horses at random and bets on them. The probability that he selected the winning horse isAnswer Choices:(a) 1\/5(b) 2\/5(c) 3\/5(d) 4\/5(e) 6\/5","target":"(b)"}
{"input":"On dividing 2272 and 875 by a 3-digit number N, we get the same remainder. The sum of the digits of N is:Answer Choices:(a) 10(b) 11(c) 12(d) 13(e) 14","target":"(a)"}
{"input":"On a test the passing students had an average of 83, while the failing students had an averageof 55. If the overall class average was 76, what percent of the class passed?Answer Choices:(a) 44%(b) 66%(c) 68%(d) 72%(e) 75%","target":"(e)"}
{"input":"The average wages of a worker during a fortnight comprising of 15 consecutive working days was $90 per day. During the first 7 days, his average wage was $87 per day and the average wage during the last 7 days was $92 per day. What was his wage on the 8th day?Answer Choices:(a) $83(b) $92(c) $90(d) $97(e) $104","target":"(d)"}
{"input":"Two numbers are in the ratio 3:5. If 9 is subtracted from each, the new numbers are in the ratio 12:23. The smaller number is?Answer Choices:(a) 21(b) 33(c) 35(d) 42(e) 58","target":"(b)"}
{"input":"If 6 yrs are subtracted from the present age of Ajay and the remainder is divided by 18, then the present age of Rahul is obtained. If Rahul is 2 yrs younger to Denis whose age is 5 yrs, then what is Ajay's present age?Answer Choices:(a) 40(b) 60(c) 70(d) 80(e) 90","target":"(b)"}
{"input":"Anna has 4 books. If she decide to arrange the 4 books in every possible combination and moved just one book every minute, how long would it taken by her ?Answer Choices:(a) 22 minutes(b) 30 minutes(c) 15 minutes(d) 24 minutes(e) 35 minutes","target":"(d)"}
{"input":"The manufacturer of tyres is offering a 20% discount on the price of its tubeless tyres. Some retailers are offering additional discounts. If a retailer offers an additional 20% discount, then what is the total discount available at that retailer?Answer Choices:(a) 10%(b) 25%(c) 28%(d) 30%(e) 36%","target":"(e)"}
{"input":"A rectangular parking space is marked out by painting three of its sides. If the length of the unpainted side is 9 feet, and the sum of the lengths of the painted sides is 37 feet, then what is the area of the parking space in square feet?Answer Choices:(a) 46(b) 81(c) 126(d) 252(e) None","target":"(c)"}
{"input":"Peter wants to find 10 additional people to form a scavenger hunt team with him. If he has 10 friends who would like to participate, how many choices does he have for forming his team?Answer Choices:(a) 0(b) 1(c) 2(d) 3(e) 4","target":"(b)"}
{"input":"The average weight of 10 oarsmen in a boat is increased by 1.8 kg when one of the crew, who weighs 53 kg is replaced by a new man. Find the weight of the new man.Answer Choices:(a) 71(b) 62(c) 43(d) 67(e) 40","target":"(a)"}
{"input":"A box contains a certain number of balls, marked successively from 1 to n. If there are 45 different ways that two balls can be selected from the box such that the ball with number 3 marked on it is not selected, then what is the value of n?Answer Choices:(a) 11(b) 10(c) 9(d) 8(e) 7","target":"(a)"}
{"input":"If Q, a positive integer, has 5 factors, which of the following must be true about Q?I. Q is the square of a prime number.II. Q is the fourth power of a prime number.III. Q is the product of two prime numbers.Answer Choices:(a) I only(b) III only(c) II only(d) I and II only(e) I and III only","target":"(b)"}
{"input":"If 6x - y = 24 and y = 3x, what is the value of x?Answer Choices:(a) 8(b) 9(c) 10(d) 11(e) 12","target":"(a)"}
{"input":"You can rent DVDs at a local video store for $4.00 per movie without a membership. However, if you purchase a membership for $7.00 per month, you can rent DVDs for $2.00 each. What is the minimum amount of DVDs you would have to rent to make it worth it to purchase the membership?Answer Choices:(a) 1(b) 2(c) 3(d) 4(e) 5","target":"(d)"}
{"input":"A bag of cat food weighs 7 pounds and 4 ounces. How much does the bag weigh in ounces?Answer Choices:(a)  108(b)  112(c)  116(d)  120(e)  124","target":"(c)"}
{"input":"By himself, Jack can clean a yacht in 12 hours. On a particular day, he happens to finish two-thirds of the work. The remaining portion of the work is done by Jill, whose rate of cleaning is just 5% of what Jack can do. How long does it take Jill to finish the remaining work?Answer Choices:(a) 4(b) 8(c) 22(d) 50(e) 20","target":"(e)"}
{"input":"Professors borrowed Rs. 5000 from the university at simple interest. After 3 years, the university got Rs. 300 on interest. What was the rate of interest per annum?Answer Choices:(a) 2%(b) 8%(c) 5%(d) 10%(e) None of these","target":"(a)"}
{"input":"In a sale, a discount of 20% was available on all the articles. If Vinit purchased an article for Rs.4578 in the sale. What was the actual selling price of the article?Answer Choices:(a) s.5050(b) s.5723(c) s.5040(d) s.4950(e) s.4870","target":"(b)"}
{"input":"If 27 bottles of soda cost A cents, how much will B bottles cost in dollars?Answer Choices:(a) AB\/2700(b) 27\/AB(c) AB\/270(d) 2700\/AB(e) 100AB\/27","target":"(a)"}
{"input":"A bag contains 11 candy bars: three cost 50 cents each, four cost $1 each and four cost $2each. How many ways can 3 candy bars be selected from the 11 candy bars so that the total cost is more than $4?Answer Choices:(a) 8(b) 28(c) 46(d) 66(e) 70","target":"(c)"}
{"input":"At a conference, one team is made up of 4 men and 4 women. Four presenters are chosen to present the team's findings in front of the entire conference. How many different groups of presenters can be chosen from the team if a team cannot be composed of men only or women only? (Two groups of presenters are considered different if at least one presenter is different.)Answer Choices:(a) 120(b) 19(c) 180(d) 420(e) 460","target":"(b)"}
{"input":"Exactly 2\/5th of the children in a certain class are girls. If there are 100 boys in the class, how many girls are in the class?Answer Choices:(a) 50(b) 100(c) 150(d) 200(e) 70","target":"(c)"}
{"input":"Two numbers are said to be relatively prime if they share no common positive factors other than 1. Set S contains the set of integers from 1 to 1,000, inclusive. What is the probability that a number chosen from S is relatively prime to 1,000?Answer Choices:(a) 5\/7(b) 3\/5(c) 4\/7(d) 2\/5(e) 2\/7","target":"(d)"}
{"input":"At the of his one-year investment, Charles received $54,080, including interest and principal from a certain investment. If the investment paid an annual interest of 8 percent compounded semi-annually, which of the following is the amount of money that Charles originally invested?Answer Choices:(a) $45,000(b) $50,000(c) $54,000(d) $59,000(e) $62,000","target":"(b)"}
{"input":"Joe's age, Joe's sister's age and Joe’s fathers age sums up to 100. When Joe is as old as his father, Joe's sister will be twice as old as now. When Joe is as old as his father then his father is twice as old as when his sister was as old as her father. Find the age of Joe's father?Answer Choices:(a) 45(b) 48(c) 50(d) 55(e) 58","target":"(c)"}
{"input":"If one third of 3\/4 of a number is 21. Then, find the number?Answer Choices:(a) 84(b) 66(c) 28(d) 19(e) 11","target":"(a)"}
{"input":"If m > 0, y > 0, and x is m percent of 4y, then, in terms of y, m is what percentage of x?Answer Choices:(a) y\/400(b) 4y(c) 50y(d) 2500\/y(e) 5000\/y","target":"(d)"}
{"input":"A man wants to eat fruit for breakfast and vegetable for dinner. He has 6 different types of fruit and 8 different types of vegetables. He can only eat one type at a time. In how many ways can he eat breakfast and dinner.Answer Choices:(a) 54(b) 24(c) 48(d) 20(e) 36","target":"(c)"}
{"input":"There is a 90% chance that a registered voter in Burghtown voted in the last election. If five registered voters are chosen at random, what is the approximate likelihood that exactly four of them voted in the last election?Answer Choices:(a) 26.2%(b) 32.8%(c) 43.7%(d) 59.0%(e) 65.6%","target":"(e)"}
{"input":"Alice wants to put up fencing around three sides of her rectangular yard and leave one side of 10 meters unfenced. If the yard has an area of 240 square meters, how many meters of fencing does she need?Answer Choices:(a) 58(b) 62(c) 66(d) 70(e) 74","target":"(a)"}
{"input":"John would make the 3-letter codes with diffenrent 5 vowels and 20 consonants with the condition that the middle letter must be vowel and the first letter and the third letter must be different from each other and are both consonant. How many different codes can be made?Answer Choices:(a) 1,980(b) 2,020(c) 2,100(d) 2,200(e) 1,900","target":"(e)"}
{"input":"What is the sum of three consecutive integers whose product can be expressed as 727+728+729.Answer Choices:(a) 37(b) 38(c) 36(d) 30(e) 39","target":"(e)"}
{"input":"The capacity of a tank of dimensions (8 m × 6 m × 2.5 m) isAnswer Choices:(a) 120 litres(b) 1200 litres(c) 12000 litres(d) 120000 litres(e) None of these","target":"(d)"}
{"input":"The population of a city is 5265526. If there are 4169516 adults in the city, how many children are there in the city?Answer Choices:(a) 1095961(b) 1065961(c) 1085961(d) 1097961(e) 1096061","target":"(e)"}
{"input":"It takes a worker 9 minutes to drive from home to work at an average rate of 20 kilometers per hour. How many minutes will it take the worker to cycle from home to work along the same route at an average rate of 6 kilometers per hour?Answer Choices:(a) 30(b) 32(c) 35(d) 36(e) 40","target":"(a)"}
{"input":"Two friends are eating a jar full of candies. Had P eaten alone, it would have taken him 10 minutes to finish the candies in the jar. Had Q eaten alone, it would have taken her 5 minutes to finish half the jar. Since both of them are eating simultaneously, how many minutes would it take them to empty the jar?Answer Choices:(a) 4(b) 5(c) 6(d) 7(e) 8","target":"(b)"}
{"input":"A grocery sells a bag of ice for $1.25, and makes 20% profit. If it sells 500 bags of ice, how much total profit does it make?Answer Choices:(a) 125(b) 150(c) 225(d) 250(e) 275","target":"(a)"}